[
    {
        "newsId": "d11kBoPy66Ret7MwWfQW",
        "title": "Goldman Sachs has launched a new apprenticeship scheme",
        "shortDescription": "Goldman Sachs has launched a new four-year, degree apprenticeship scheme. ",
        "content": "<h2>Goldman Sachs'<a href=\"https://www.goldmansachs.com/careers/students/programs/emea/degree-apprentices.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(17, 17, 17);\">&nbsp;Global Markets Degree Apprenticeship scheme</a>&nbsp;— which opened for applications on Monday — offers apprentices the chance to earn a degree in Applied Finance while working a full time job at its London offices.&nbsp;</h2><p>Apprentices will work five days a week on the trading floor in return for a competitive salary and bonuses, and complete their studies in two stints every semester,&nbsp;<a href=\"https://www.theguardian.com/business/2021/dec/12/goldman-sachs-starts-trading-floor-apprenticeship-scheme-to-boost-diversity\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(17, 17, 17);\">The Guardian newspaper reported</a>.&nbsp;</p><p>The move comes with banks under pressure to improve their levels of diversity amid an increasingly competitive labor market. A 2020 report by the City of London Corporation found that nine in 10 senior roles were held by someone from a higher socio-economic background.&nbsp;</p><p>Under the Goldman scheme, which is initially open to 10 students, the bank will pay for relocation costs, equipment and tuition fees.&nbsp;</p><p>The four year apprenticeship, offered in conjunction with Queen Mary University of London, will start in September 2022. Applications close on Feb 27th, 2022.&nbsp;</p><p><a href=\"https://www.businessinsider.com/goldman-sachs-investment-bank-2022-apprenticeship-scheme-opens-for-applications-2021-12?r=US&IR=T\" target=\"_blank\">Find Out More</a></p>",
        "username": "JustAppli",
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/justappli-b9f5c.appspot.com/o/profile-images%2F260968181805.png?alt=media&token=e18cb2da-35e3-4bab-81be-651f5f210bec",
        "userId": "tMWd7ccvWJTsptr7sbgSwZiNeom2",
        "createdAt": "2021-12-29T23:38:01.661Z",
        "uploadUrl": "https://firebasestorage.googleapis.com/v0/b/justappli-b9f5c.appspot.com/o/news%2F608101005805.jpeg?alt=media&token=a4136d7d-49f3-4f71-a935-fbdc8401d0ff",
        "contentType": "news",
        "category": "News",
        "likeCount": 0,
        "commentCount": 0,
        "viewsCount": 177,
        "isPartner": false
    },
    {
        "newsId": "mZe14Yoja7OdQSbxtc0J",
        "title": "Rolls-Royce is offering record number of apprenticeships for next year",
        "shortDescription": "Rolls-Royce Motor Cars is offering a record 37 places on its apprenticeship programme for 2022.",
        "content": "<h2>Candidates will spend 2-4 years receiving paid on-the-job training and part-time formal education, leading to NVQ Level 3, HNC, HND and degree qualifications.</h2><p>The opportunity is for post-16 students seeking hands-on experience with a world-class company as a direct route into work or a fully-funded alternative to university.</p><p><strong>Applications close on 20 February 2022.</strong></p><p>Torsten Müller-Ötvös, CEO of Rolls-Royce Motor Cars, commented: “We have always recognised the fundamental importance of investing in future talent, not just to support our own business objectives, but to build the skills and knowledge base within UK luxury more widely. As well as receiving world-class training in practical craft, technical or business skills, while being paid, our apprentices study for qualifications up to and including degrees, all fully funded by the company.</p><p>“It's an amazing opportunity and a really attractive alternative to university for those who thrive in a more hands-on learning environment.”</p><p>The 37 places on the programme are the largest intake since the scheme’s inception in 2006.</p><p>The number of places available is up by more than 15% on the previous record set in 2020, reflecting the company's strong business performance, new model launches, including Ghost and its Black Badge variant, and the advent of a new generation of all-electric vehicles headed by the recently-announced Spectre.</p><p><br></p><p><a href=\"https://www.pesmedia.com/rolls-royce-motor-cars-apprenticeship-15122021\" rel=\"noopener noreferrer\" target=\"_blank\">Find Out More</a> </p>",
        "username": "JustAppli",
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/justappli-b9f5c.appspot.com/o/profile-images%2F260968181805.png?alt=media&token=e18cb2da-35e3-4bab-81be-651f5f210bec",
        "userId": "tMWd7ccvWJTsptr7sbgSwZiNeom2",
        "createdAt": "2021-12-29T23:12:48.296Z",
        "uploadUrl": "https://firebasestorage.googleapis.com/v0/b/justappli-b9f5c.appspot.com/o/news%2F276158804233.jpg?alt=media&token=3c80b18c-e66e-40de-95aa-89495fc1a1e8",
        "contentType": "news",
        "category": "News",
        "likeCount": 0,
        "commentCount": 0,
        "viewsCount": 205,
        "isPartner": false
    },
    {
        "newsId": "q4ovPlWEOuRD3mT9UJqE",
        "title": "The importance of leaving college with life skills",
        "shortDescription": "New wellbeing package of eight complementary qualifications designed to enhance employability skills for learners.",
        "content": "<h2>When we think of Further Education, we tend to think of specific subjects that may lead to university courses or vocational and professional qualifications that give students ‘hard skills’. But what of the ‘soft skills’ – the art of social interaction, empathy and self-awareness?</h2> <p>Do colleges bring enough emphasis to these? And is there a college equivalent to PSHE studied at school that will give students a good steer on their personal wellbeing, diet, lifestyle and exercise choices?</p><p>On leaving college and seeking employment, students with life skills and social skills will be favoured by employers. Candidates who display health, confidence, self and social awareness will stand head and shoulders above other candidates.</p><p>The welfare of workforces during the pandemic put workplace wellbeing in the spotlight. Employees’ mental health and physical health were of as much a concern as their work performance. Employers were increasingly being held to account for managing the wellbeing of their staff. Not surprisingly, as people struggled to adapt and cope, empathy and social awareness became of paramount importance. As further education, internships and recruiting youngsters into their first job return to a more ‘normal’ pattern, it’s important we don’t forget the value of life skills and soft skills among students...</p><p><a href=\"https://feweek.co.uk/the-importance-of-leaving-college-with-life-skills/\" rel=\"noopener noreferrer\" target=\"_blank\">Read More</a></p>",
        "username": "JustAppli",
        "imageUrl": "https://firebasestorage.googleapis.com/v0/b/justappli-b9f5c.appspot.com/o/profile-images%2F260968181805.png?alt=media&token=e18cb2da-35e3-4bab-81be-651f5f210bec",
        "userId": "tMWd7ccvWJTsptr7sbgSwZiNeom2",
        "createdAt": "2021-12-29T22:21:08.605Z",
        "uploadUrl": "https://firebasestorage.googleapis.com/v0/b/justappli-b9f5c.appspot.com/o/news%2F500726657422.jpeg?alt=media&token=33de78a5-c799-4151-b242-ca8e9b4d4bea",
        "contentType": "news",
        "category": "News",
        "likeCount": 0,
        "commentCount": 0,
        "viewsCount": 44,
        "isPartner": false
    }
]